# Используйте официальный образ Python в качестве родительского образа
FROM python:3.12.0-slim

# Установите рабочий каталог в контейнере
WORKDIR /usr/src/app

# Скопируйте содержимое текущего каталога в контейнер по пути /usr/src/app
COPY . .

# Установите необходимые пакеты, указанные в файле requirements.txt
RUN pip install --no-cache-dir Flask

# Сделайте порт 80 доступным для мира :) за пределами этого контейнера
EXPOSE 80

# Определите переменную окружения
ENV NAME World

# Запустите app.py при запуске контейнера
CMD ["python", "app.py"]
